[
  {
    "id": "1",
    "title": "Why Blood Donation is Important",
    "author": "BloodCare Team",
    "date": "12 Aug 2025",
    "image": "https://images.unsplash.com/photo-1615461066841-6116e61058f4",
    "content": "Blood donation is one of the most powerful and selfless acts a human being can perform. Every day, thousands of people around the world depend on donated blood for survival. Accident victims, patients undergoing surgery, cancer patients, and mothers facing childbirth complications all require timely access to safe blood.A single unit of donated blood can save up to three lives when separated into red cells, plasma, and platelets. This makes every donor extremely valuable to the healthcare system. Blood cannot be manufactured artificially, which means voluntary donors are the only source.Donating blood is not only beneficial for recipients, but it also offers health benefits to donors. It helps stimulate the production of new blood cells, maintains healthy iron levels, and allows for basic health screening before donation. Most importantly, it provides a sense of purpose and contribution to society.Despite the importance, many countries still face a shortage of blood. Awareness, education, and community involvement are key to solving this problem. By donating blood regularly, you become a silent hero who saves lives without even knowing the people you help.Remember, your one decision to donate blood can give someone else a second chance at life."
  },
  {
    "id": "2",
    "title": "Who Can Donate Blood?",
    "author": "Medical Awareness Team",
    "date": "05 Aug 2025",
    "image": "https://images.unsplash.com/photo-1588776814546-1ffcf47267a5",
    "content": "Many people want to donate blood but are unsure whether they are eligible. The good news is that most healthy adults can donate blood safely. Generally, donors must be between 18 and 60 years old, weigh at least 50 kilograms, and be in good overall health.Before donating blood, a basic health screening is conducted. This includes checking hemoglobin levels, blood pressure, pulse, and body temperature. These steps ensure the safety of both the donor and the recipient.Certain temporary conditions may prevent donation, such as recent surgery, infections, pregnancy, or recent vaccinations. However, these restrictions are usually short-term, and donors can give blood again once they recover.Chronic illnesses like diabetes or high blood pressure do not always disqualify a person from donating blood if the condition is well controlled. It is always best to consult medical professionals or donation center guidelines.nBy understanding eligibility criteria, more people can confidently come forward to donate blood and help maintain a stable blood supply for emergencies."
  },
  {
    "id": "3",
    "title": "The Role of Volunteers in Blood Donation",
    "author": "Community Support Team",
    "date": "01 Aug 2025",
    "image": "https://images.unsplash.com/photo-1526256262350-7da7584cf5eb",
    "content": "Volunteers play a crucial role in the success of blood donation programs. They act as the bridge between donors and recipients, ensuring that help reaches those who need it most.From organizing blood donation camps to spreading awareness on social media, volunteers are involved at every level. They help donors register, guide them through the donation process, and provide post-donation care and support.In emergency situations, volunteers often work tirelessly to locate suitable donors within a short time. Their dedication and quick response can mean the difference between life and death.Volunteering in blood donation initiatives also builds strong community bonds. It creates a culture of empathy, responsibility, and collective action.Anyone can become a volunteer, regardless of age or profession. By giving your time and effort, you become a vital part of a life-saving network that benefits society as a whole."
  }
]
